In [6]:
import pandas as pd
df1 = pd.DataFrame({
    'a': [2],
    'b': ["saddam"]
})

In [18]:
import pandas as pd
df2 = pd.DataFrame({
    'a': [2],
    'b': ["ali"]
})

In [9]:
df = pd.concat(df1,df2)
df

TypeError: concat() takes 1 positional argument but 2 were given

In [10]:
df = pd.concat([df1,df2])
df

   a       b
0  2  saddam
0  5     ali

In [11]:
df2 = pd.DataFrame({
    'a': [5],
    'c': ["ali"]
})

In [12]:
df = pd.concat([df1,df2])
df

   a       b    c
0  2  saddam  NaN
0  5     NaN  ali

In [13]:
df = pd.concat([df1,df2],axis=1)
df

   a       b  a    c
0  2  saddam  5  ali

In [16]:
df1

   a       b
0  2  saddam

In [19]:
df2

   a    b
0  2  ali

In [20]:
df = pd.merge(df1,df2,on=['a'])
df

   a     b_x  b_y
0  2  saddam  ali

In [21]:
df = pd.melt(df1)
df

  variable   value
0        a       2
1        b  saddam